# Taps
tap 'homebrew/cask'
tap 'homebrew/bundle'

# Binaries
brew 'autoconf'
brew 'automake'
brew 'htop'
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'pkg-config'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'webp'

# Development
brew 'pkgxdev/made/pkgx'

cask_args appdir: "~/Applications", require_sha: true

# Apps
cask '1password'
cask 'bartender'
cask 'boop'
cask 'balance-lock'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'droplr'
cask 'firefox'
cask 'forklift'
cask 'google-chrome'
cask 'herd'
cask 'insomnia'
cask 'phpstorm'
cask 'ray'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'tinkerwell'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Unsplash Wallpapers', id: 1284863847