# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap "shivammathur/php"

# Binaries
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'htop'
brew 'mycli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'starship'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'
brew 'webp'

# Development
brew 'shivammathur/php/php@8.1'
brew 'shivammathur/php/php@8.0'
brew 'shivammathur/php/php@7.4'
brew 'shivammathur/php/php@5.6'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'redis'
brew 'ruby'

# Apps
cask '1password'
cask 'bartender'
cask 'boop'
cask 'balance-lock'
cask 'discord'
cask 'docker'
cask 'droplr'
cask 'firefox'
cask 'forklift'
cask 'google-chrome'
cask 'insomnia'
cask 'messenger'
cask 'notion'
cask 'phpstorm'
cask 'ray'
cask 'spotify'
cask 'sublime-text'
cask 'tableplus'
cask 'tinkerwell'
cask 'wkhtmltopdf'
cask 'phpmon'


# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Unsplash Wallpapers', id: 1284863847